pierremolinaro/piccolo-dev/galgas_sources/GALGAS_OUTPUT/pic18_intermediate_next_intruction_is_reachable.cpp
//---------------------------------------------------------------------------*
//                                                                           *
//        File 'pic18_intermediate_next_intruction_is_reachable.cpp'         *
//                        Generated by version 2.4.7                         *
//                       july 6th, 2013, at 9h58'39"                         *
//                                                                           *
//---------------------------------------------------------------------------*

//--- START OF USER ZONE 1


//--- END OF USER ZONE 1

#include "pic18_intermediate_next_intruction_is_reachable.h"
#include "galgas2/C_Compiler.h"
#include "galgas2/C_galgas_io.h"
#include "galgas2/C_galgas_CLI_Options.h"
#include "utilities/C_PrologueEpilogue.h"

//---------------------------------------------------------------------------*


//---------------------------------------------------------------------------*

#ifndef DO_NOT_GENERATE_CHECKINGS
  #define SOURCE_FILE_AT_LINE(line) "pic18_intermediate_next_intruction_is_reachable.gSemantics", line
  #define COMMA_SOURCE_FILE_AT_LINE(line) , SOURCE_FILE_AT_LINE(line)
#else
  #define SOURCE_FILE_AT_LINE(line) 
  #define COMMA_SOURCE_FILE_AT_LINE(line) 
#endif

//---------------------------------------------------------------------------*
//                                                                           *
//Category reader '@pic18_intermediate_instruction nextInstructionIsReachable'*
//                                                                           *
//---------------------------------------------------------------------------*

static TC_UniqueArray <categoryReaderSignature_pic_31__38__5F_intermediate_5F_instruction_nextInstructionIsReachable> gCategoryReaderTable_pic_31__38__5F_intermediate_5F_instruction_nextInstructionIsReachable ;

//---------------------------------------------------------------------------*

void enterCategoryReader_nextInstructionIsReachable (const PMSInt32 inClassIndex,
                                                     categoryReaderSignature_pic_31__38__5F_intermediate_5F_instruction_nextInstructionIsReachable inReader) {
  gCategoryReaderTable_pic_31__38__5F_intermediate_5F_instruction_nextInstructionIsReachable.forceObjectAtIndex (inClassIndex, inReader, NULL COMMA_HERE) ;
}

//---------------------------------------------------------------------------*

GALGAS_bool callCategoryReader_nextInstructionIsReachable (const cPtr_pic_31__38__5F_intermediate_5F_instruction * inObject,
                                                           C_Compiler * inCompiler
                                                           COMMA_LOCATION_ARGS) {
  GALGAS_bool result ;
//--- Find Reader
  if (NULL != inObject) {
    macroValidSharedObject (inObject, const cPtr_pic_31__38__5F_intermediate_5F_instruction) ;
    const C_galgas_type_descriptor * info = inObject->classDescriptor () ;
    const PMSInt32 classIndex = info->mSlotID ;
    categoryReaderSignature_pic_31__38__5F_intermediate_5F_instruction_nextInstructionIsReachable f = NULL ;
    if (classIndex < gCategoryReaderTable_pic_31__38__5F_intermediate_5F_instruction_nextInstructionIsReachable.count ()) {
      f = gCategoryReaderTable_pic_31__38__5F_intermediate_5F_instruction_nextInstructionIsReachable (classIndex COMMA_HERE) ;
    }
    if (NULL == f) {
       const C_galgas_type_descriptor * p = info->mSuperclassDescriptor ;
       while ((NULL == f) && (NULL != p)) {
         if (p->mSlotID < gCategoryReaderTable_pic_31__38__5F_intermediate_5F_instruction_nextInstructionIsReachable.count ()) {
           f = gCategoryReaderTable_pic_31__38__5F_intermediate_5F_instruction_nextInstructionIsReachable (p->mSlotID COMMA_HERE) ;
         }
         p = p->mSuperclassDescriptor ;
       }
       gCategoryReaderTable_pic_31__38__5F_intermediate_5F_instruction_nextInstructionIsReachable.forceObjectAtIndex (classIndex, f, NULL COMMA_HERE) ;
    }
    if (NULL == f) {
      fatalError ("FATAL CATEGORY READER CALL ERROR", __FILE__, __LINE__) ;
    }else{
      result = f (inObject, inCompiler COMMA_THERE) ;
    }
  }
  return result ;
}

//---------------------------------------------------------------------------*

static GALGAS_bool categoryReader_pic_31__38__5F_intermediate_5F_instruction_nextInstructionIsReachable (const cPtr_pic_31__38__5F_intermediate_5F_instruction * /* inObject */,
                                                                                                         C_Compiler * /* inCompiler */
                                                                                                         COMMA_UNUSED_LOCATION_ARGS) {
  GALGAS_bool result_outIsReachable ; // Returned variable
  result_outIsReachable = GALGAS_bool (true) ;
//---
  return result_outIsReachable ;
}


//---------------------------------------------------------------------------*

static void defineCategoryReader_pic_31__38__5F_intermediate_5F_instruction_nextInstructionIsReachable (void) {
  enterCategoryReader_nextInstructionIsReachable (kTypeDescriptor_GALGAS_pic_31__38__5F_intermediate_5F_instruction.mSlotID,
                                                  categoryReader_pic_31__38__5F_intermediate_5F_instruction_nextInstructionIsReachable) ;
}

//---------------------------------------------------------------------------*

static void freeCategoryReader_pic_31__38__5F_intermediate_5F_instruction_nextInstructionIsReachable (void) {
  gCategoryReaderTable_pic_31__38__5F_intermediate_5F_instruction_nextInstructionIsReachable.free () ;
}

//---------------------------------------------------------------------------*

C_PrologueEpilogue gReader_pic_31__38__5F_intermediate_5F_instruction_nextInstructionIsReachable (defineCategoryReader_pic_31__38__5F_intermediate_5F_instruction_nextInstructionIsReachable,
                                                                                                  freeCategoryReader_pic_31__38__5F_intermediate_5F_instruction_nextInstructionIsReachable) ;

//---------------------------------------------------------------------------*
//                                                                           *
//Overriding category reader '@pic18_intermediate_JUMP nextInstructionIsReachable'*
//                                                                           *
//---------------------------------------------------------------------------*

static GALGAS_bool categoryReader_pic_31__38__5F_intermediate_5F_JUMP_nextInstructionIsReachable (const cPtr_pic_31__38__5F_intermediate_5F_instruction * /* inObject */,
                                                                                                  C_Compiler * /* inCompiler */
                                                                                                  COMMA_UNUSED_LOCATION_ARGS) {
  GALGAS_bool result_outIsReachable ; // Returned variable
  result_outIsReachable = GALGAS_bool (false) ;
//---
  return result_outIsReachable ;
}


//---------------------------------------------------------------------------*

static void defineCategoryReader_pic_31__38__5F_intermediate_5F_JUMP_nextInstructionIsReachable (void) {
  enterCategoryReader_nextInstructionIsReachable (kTypeDescriptor_GALGAS_pic_31__38__5F_intermediate_5F_JUMP.mSlotID,
                                                  categoryReader_pic_31__38__5F_intermediate_5F_JUMP_nextInstructionIsReachable) ;
}

//---------------------------------------------------------------------------*

