pierremolinaro/piccolo-dev/galgas_sources/GALGAS_OUTPUT/pic18_intermediate_next_intruction_is_reachable.cpp
C_PrologueEpilogue gReader_pic_31__38__5F_intermediate_5F_JUMP_nextInstructionIsReachable (defineCategoryReader_pic_31__38__5F_intermediate_5F_JUMP_nextInstructionIsReachable, NULL) ;

//---------------------------------------------------------------------------*
//                                                                           *
//Overriding category reader '@pic18_intermediate_instruction_RETURN nextInstructionIsReachable'*
//                                                                           *
//---------------------------------------------------------------------------*

static GALGAS_bool categoryReader_pic_31__38__5F_intermediate_5F_instruction_5F_RETURN_nextInstructionIsReachable (const cPtr_pic_31__38__5F_intermediate_5F_instruction * /* inObject */,
                                                                                                                   C_Compiler * /* inCompiler */
                                                                                                                   COMMA_UNUSED_LOCATION_ARGS) {
  GALGAS_bool result_outIsReachable ; // Returned variable
  result_outIsReachable = GALGAS_bool (false) ;
//---
  return result_outIsReachable ;
}


//---------------------------------------------------------------------------*

static void defineCategoryReader_pic_31__38__5F_intermediate_5F_instruction_5F_RETURN_nextInstructionIsReachable (void) {
  enterCategoryReader_nextInstructionIsReachable (kTypeDescriptor_GALGAS_pic_31__38__5F_intermediate_5F_instruction_5F_RETURN.mSlotID,
                                                  categoryReader_pic_31__38__5F_intermediate_5F_instruction_5F_RETURN_nextInstructionIsReachable) ;
}

//---------------------------------------------------------------------------*

C_PrologueEpilogue gReader_pic_31__38__5F_intermediate_5F_instruction_5F_RETURN_nextInstructionIsReachable (defineCategoryReader_pic_31__38__5F_intermediate_5F_instruction_5F_RETURN_nextInstructionIsReachable, NULL) ;

//---------------------------------------------------------------------------*
//                                                                           *
//Overriding category reader '@pic18_intermediate_instruction_RETURN_NOT_OPTIMIZABLE nextInstructionIsReachable'*
//                                                                           *
//---------------------------------------------------------------------------*

static GALGAS_bool categoryReader_pic_31__38__5F_intermediate_5F_instruction_5F_RETURN_5F_NOT_5F_OPTIMIZABLE_nextInstructionIsReachable (const cPtr_pic_31__38__5F_intermediate_5F_instruction * /* inObject */,
                                                                                                                                         C_Compiler * /* inCompiler */
                                                                                                                                         COMMA_UNUSED_LOCATION_ARGS) {
  GALGAS_bool result_outIsReachable ; // Returned variable
  result_outIsReachable = GALGAS_bool (false) ;
//---
  return result_outIsReachable ;
}


//---------------------------------------------------------------------------*

static void defineCategoryReader_pic_31__38__5F_intermediate_5F_instruction_5F_RETURN_5F_NOT_5F_OPTIMIZABLE_nextInstructionIsReachable (void) {
  enterCategoryReader_nextInstructionIsReachable (kTypeDescriptor_GALGAS_pic_31__38__5F_intermediate_5F_instruction_5F_RETURN_5F_NOT_5F_OPTIMIZABLE.mSlotID,
                                                  categoryReader_pic_31__38__5F_intermediate_5F_instruction_5F_RETURN_5F_NOT_5F_OPTIMIZABLE_nextInstructionIsReachable) ;
}

//---------------------------------------------------------------------------*

C_PrologueEpilogue gReader_pic_31__38__5F_intermediate_5F_instruction_5F_RETURN_5F_NOT_5F_OPTIMIZABLE_nextInstructionIsReachable (defineCategoryReader_pic_31__38__5F_intermediate_5F_instruction_5F_RETURN_5F_NOT_5F_OPTIMIZABLE_nextInstructionIsReachable, NULL) ;

//---------------------------------------------------------------------------*
//                                                                           *
//Overriding category reader '@pic18_intermediate_instruction_RETFIE nextInstructionIsReachable'*
//                                                                           *
//---------------------------------------------------------------------------*

static GALGAS_bool categoryReader_pic_31__38__5F_intermediate_5F_instruction_5F_RETFIE_nextInstructionIsReachable (const cPtr_pic_31__38__5F_intermediate_5F_instruction * /* inObject */,
                                                                                                                   C_Compiler * /* inCompiler */
                                                                                                                   COMMA_UNUSED_LOCATION_ARGS) {
  GALGAS_bool result_outIsReachable ; // Returned variable
  result_outIsReachable = GALGAS_bool (false) ;
//---
  return result_outIsReachable ;
}


//---------------------------------------------------------------------------*

static void defineCategoryReader_pic_31__38__5F_intermediate_5F_instruction_5F_RETFIE_nextInstructionIsReachable (void) {
  enterCategoryReader_nextInstructionIsReachable (kTypeDescriptor_GALGAS_pic_31__38__5F_intermediate_5F_instruction_5F_RETFIE.mSlotID,
                                                  categoryReader_pic_31__38__5F_intermediate_5F_instruction_5F_RETFIE_nextInstructionIsReachable) ;
}

//---------------------------------------------------------------------------*

C_PrologueEpilogue gReader_pic_31__38__5F_intermediate_5F_instruction_5F_RETFIE_nextInstructionIsReachable (defineCategoryReader_pic_31__38__5F_intermediate_5F_instruction_5F_RETFIE_nextInstructionIsReachable, NULL) ;

//---------------------------------------------------------------------------*
//                                                                           *
//Overriding category reader '@pic18_intermediate_instruction_literalOperation nextInstructionIsReachable'*
//                                                                           *
//---------------------------------------------------------------------------*

static GALGAS_bool categoryReader_pic_31__38__5F_intermediate_5F_instruction_5F_literalOperation_nextInstructionIsReachable (const cPtr_pic_31__38__5F_intermediate_5F_instruction * /* inObject */,
                                                                                                                             C_Compiler * /* inCompiler */
                                                                                                                             COMMA_UNUSED_LOCATION_ARGS) {
  GALGAS_bool result_outIsReachable ; // Returned variable
  result_outIsReachable = GALGAS_bool (true) ;
//---
  return result_outIsReachable ;
}


//---------------------------------------------------------------------------*

static void defineCategoryReader_pic_31__38__5F_intermediate_5F_instruction_5F_literalOperation_nextInstructionIsReachable (void) {
  enterCategoryReader_nextInstructionIsReachable (kTypeDescriptor_GALGAS_pic_31__38__5F_intermediate_5F_instruction_5F_literalOperation.mSlotID,
                                                  categoryReader_pic_31__38__5F_intermediate_5F_instruction_5F_literalOperation_nextInstructionIsReachable) ;
}

//---------------------------------------------------------------------------*

C_PrologueEpilogue gReader_pic_31__38__5F_intermediate_5F_instruction_5F_literalOperation_nextInstructionIsReachable (defineCategoryReader_pic_31__38__5F_intermediate_5F_instruction_5F_literalOperation_nextInstructionIsReachable, NULL) ;

//---------------------------------------------------------------------------*
//                                                                           *
//Overriding category reader '@pic18_intermediate_instruction_RETLW nextInstructionIsReachable'*
//                                                                           *
//---------------------------------------------------------------------------*

static GALGAS_bool categoryReader_pic_31__38__5F_intermediate_5F_instruction_5F_RETLW_nextInstructionIsReachable (const cPtr_pic_31__38__5F_intermediate_5F_instruction * /* inObject */,
                                                                                                                  C_Compiler * /* inCompiler */
                                                                                                                  COMMA_UNUSED_LOCATION_ARGS) {
  GALGAS_bool result_outIsReachable ; // Returned variable
  result_outIsReachable = GALGAS_bool (false) ;
//---
  return result_outIsReachable ;
}


//---------------------------------------------------------------------------*

