pierremolinaro/piccolo-dev/galgas_sources/GALGAS_OUTPUT/pic18_intermediate_next_intruction_is_reachable.cpp
static void defineCategoryReader_pic_31__38__5F_intermediate_5F_instruction_5F_RETLW_nextInstructionIsReachable (void) {
  enterCategoryReader_nextInstructionIsReachable (kTypeDescriptor_GALGAS_pic_31__38__5F_intermediate_5F_instruction_5F_RETLW.mSlotID,
                                                  categoryReader_pic_31__38__5F_intermediate_5F_instruction_5F_RETLW_nextInstructionIsReachable) ;
}

//---------------------------------------------------------------------------*

C_PrologueEpilogue gReader_pic_31__38__5F_intermediate_5F_instruction_5F_RETLW_nextInstructionIsReachable (defineCategoryReader_pic_31__38__5F_intermediate_5F_instruction_5F_RETLW_nextInstructionIsReachable, NULL) ;

//---------------------------------------------------------------------------*
//                                                                           *
//Overriding category reader '@pic18_intermediate_instruction_computed_retlw nextInstructionIsReachable'*
//                                                                           *
//---------------------------------------------------------------------------*

static GALGAS_bool categoryReader_pic_31__38__5F_intermediate_5F_instruction_5F_computed_5F_retlw_nextInstructionIsReachable (const cPtr_pic_31__38__5F_intermediate_5F_instruction * /* inObject */,
                                                                                                                              C_Compiler * /* inCompiler */
                                                                                                                              COMMA_UNUSED_LOCATION_ARGS) {
  GALGAS_bool result_outIsReachable ; // Returned variable
  result_outIsReachable = GALGAS_bool (false) ;
//---
  return result_outIsReachable ;
}


//---------------------------------------------------------------------------*

static void defineCategoryReader_pic_31__38__5F_intermediate_5F_instruction_5F_computed_5F_retlw_nextInstructionIsReachable (void) {
  enterCategoryReader_nextInstructionIsReachable (kTypeDescriptor_GALGAS_pic_31__38__5F_intermediate_5F_instruction_5F_computed_5F_retlw.mSlotID,
                                                  categoryReader_pic_31__38__5F_intermediate_5F_instruction_5F_computed_5F_retlw_nextInstructionIsReachable) ;
}

//---------------------------------------------------------------------------*

C_PrologueEpilogue gReader_pic_31__38__5F_intermediate_5F_instruction_5F_computed_5F_retlw_nextInstructionIsReachable (defineCategoryReader_pic_31__38__5F_intermediate_5F_instruction_5F_computed_5F_retlw_nextInstructionIsReachable, NULL) ;

//---------------------------------------------------------------------------*
//                                                                           *
//Overriding category reader '@pic18_intermediate_instruction_computed_bra nextInstructionIsReachable'*
//                                                                           *
//---------------------------------------------------------------------------*

static GALGAS_bool categoryReader_pic_31__38__5F_intermediate_5F_instruction_5F_computed_5F_bra_nextInstructionIsReachable (const cPtr_pic_31__38__5F_intermediate_5F_instruction * /* inObject */,
                                                                                                                            C_Compiler * /* inCompiler */
                                                                                                                            COMMA_UNUSED_LOCATION_ARGS) {
  GALGAS_bool result_outIsReachable ; // Returned variable
  result_outIsReachable = GALGAS_bool (false) ;
//---
  return result_outIsReachable ;
}


//---------------------------------------------------------------------------*

static void defineCategoryReader_pic_31__38__5F_intermediate_5F_instruction_5F_computed_5F_bra_nextInstructionIsReachable (void) {
  enterCategoryReader_nextInstructionIsReachable (kTypeDescriptor_GALGAS_pic_31__38__5F_intermediate_5F_instruction_5F_computed_5F_bra.mSlotID,
                                                  categoryReader_pic_31__38__5F_intermediate_5F_instruction_5F_computed_5F_bra_nextInstructionIsReachable) ;
}

//---------------------------------------------------------------------------*

C_PrologueEpilogue gReader_pic_31__38__5F_intermediate_5F_instruction_5F_computed_5F_bra_nextInstructionIsReachable (defineCategoryReader_pic_31__38__5F_intermediate_5F_instruction_5F_computed_5F_bra_nextInstructionIsReachable, NULL) ;

//---------------------------------------------------------------------------*
//                                                                           *
//Overriding category reader '@pic18_intermediate_instruction_computed_goto nextInstructionIsReachable'*
//                                                                           *
//---------------------------------------------------------------------------*

static GALGAS_bool categoryReader_pic_31__38__5F_intermediate_5F_instruction_5F_computed_5F_goto_nextInstructionIsReachable (const cPtr_pic_31__38__5F_intermediate_5F_instruction * /* inObject */,
                                                                                                                             C_Compiler * /* inCompiler */
                                                                                                                             COMMA_UNUSED_LOCATION_ARGS) {
  GALGAS_bool result_outIsReachable ; // Returned variable
  result_outIsReachable = GALGAS_bool (false) ;
//---
  return result_outIsReachable ;
}


//---------------------------------------------------------------------------*

static void defineCategoryReader_pic_31__38__5F_intermediate_5F_instruction_5F_computed_5F_goto_nextInstructionIsReachable (void) {
  enterCategoryReader_nextInstructionIsReachable (kTypeDescriptor_GALGAS_pic_31__38__5F_intermediate_5F_instruction_5F_computed_5F_goto.mSlotID,
                                                  categoryReader_pic_31__38__5F_intermediate_5F_instruction_5F_computed_5F_goto_nextInstructionIsReachable) ;
}

//---------------------------------------------------------------------------*

C_PrologueEpilogue gReader_pic_31__38__5F_intermediate_5F_instruction_5F_computed_5F_goto_nextInstructionIsReachable (defineCategoryReader_pic_31__38__5F_intermediate_5F_instruction_5F_computed_5F_goto_nextInstructionIsReachable, NULL) ;

//---------------------------------------------------------------------------*
//                                                                           *
//Overriding category reader '@pic18_intermediate_instruction_computed_rcall nextInstructionIsReachable'*
//                                                                           *
//---------------------------------------------------------------------------*

static GALGAS_bool categoryReader_pic_31__38__5F_intermediate_5F_instruction_5F_computed_5F_rcall_nextInstructionIsReachable (const cPtr_pic_31__38__5F_intermediate_5F_instruction * /* inObject */,
                                                                                                                              C_Compiler * /* inCompiler */
                                                                                                                              COMMA_UNUSED_LOCATION_ARGS) {
  GALGAS_bool result_outIsReachable ; // Returned variable
  result_outIsReachable = GALGAS_bool (true) ;
//---
  return result_outIsReachable ;
}


//---------------------------------------------------------------------------*

static void defineCategoryReader_pic_31__38__5F_intermediate_5F_instruction_5F_computed_5F_rcall_nextInstructionIsReachable (void) {
  enterCategoryReader_nextInstructionIsReachable (kTypeDescriptor_GALGAS_pic_31__38__5F_intermediate_5F_instruction_5F_computed_5F_rcall.mSlotID,
                                                  categoryReader_pic_31__38__5F_intermediate_5F_instruction_5F_computed_5F_rcall_nextInstructionIsReachable) ;
}

//---------------------------------------------------------------------------*

C_PrologueEpilogue gReader_pic_31__38__5F_intermediate_5F_instruction_5F_computed_5F_rcall_nextInstructionIsReachable (defineCategoryReader_pic_31__38__5F_intermediate_5F_instruction_5F_computed_5F_rcall_nextInstructionIsReachable, NULL) ;

//--- START OF USER ZONE 2


//--- END OF USER ZONE 2


